sql is the standard language for managing and manipulating relational database. 
sqlite is the self contained , serverless, and zero-configuration database engine that is 
widely used for embedded database system.

In [36]:
import sqlite3

In [37]:
#connect the sqlite database
connection=sqlite3.connect('exampleDb')
connection

In [20]:
cursor=connection.cursor()

In [21]:
#create a table in the database
cursor.execute(
   '''
     Create Table If Not Exists students (
         id Integer Primary Key,
         name Text Not Null,
         age Integer,
         department Text
     )
    '''
)
#commit the changes
connection.commit()

In [22]:
cursor.execute(
    ''' 
      Select * from students
    '''
)

In [23]:
#insert into database
cursor.execute(
    ''' 
     Insert Into students(name,age,department) 
       values('Mojahid',23,'CSE')
    '''
)
cursor.execute(
    ''' 
     Insert Into students(name,age,department) 
       values('Arif',25,'EEE')
    '''
)
connection.commit()

In [24]:
#query to get the data 
cursor.execute(''' Select * from students ''')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'Mojahid', 23, 'CSE')
(2, 'Arif', 29, 'EEE')
(3, 'Tamim', 23, 'BBA')
(4, 'Mojahid', 23, 'CSE')
(5, 'Arif', 25, 'EEE')

In [25]:
#update data
cursor.execute('''
                Update  students
                set age=29
                where name='Arif'
               ''')

connection.commit()

In [26]:
#query to get the data 
cursor.execute(''' Select * from students ''')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'Mojahid', 23, 'CSE')
(2, 'Arif', 29, 'EEE')
(3, 'Tamim', 23, 'BBA')
(4, 'Mojahid', 23, 'CSE')
(5, 'Arif', 29, 'EEE')

In [52]:
#delete from table

cursor.execute('''
               Delete From students 
                where id=4
               ''')

connection.commit()

In [53]:
#query to get the data 
cursor.execute(''' Select * from students ''')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'Mojahid', 23, 'CSE')
(2, 'Arif', 29, 'EEE')
(5, 'Arif', 29, 'EEE')

In [29]:
#product table
cursor.execute('''
               Create Table If Not Exists sales
               (
                   id Integer Primary Key,
                   date Text,
                   name Text,
                   price Integer
               )
               ''')

connection.commit()

In [30]:
sales_data=[
    ('10-12-23','orange',500),
    ('10-12-23','apple',400),
    ('10-12-23','banana',200),
    ('10-12-23','pinaple',100),
    
]

In [31]:
cursor.executemany('''
                       
                       Insert into sales('date','name','price')
                       values(?,?,?)
                       ''',sales_data)

connection.commit()

In [66]:
cursor.execute('''
               Delete From sales 
                where id=6
               ''')

connection.commit()

In [67]:
#query to get the data 
cursor.execute(''' Select * from sales ''')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, '10-12-23', 'orange', 500)
(2, '10-12-23', 'apple', 400)
(3, '10-12-23', 'banana', 200)
(4, '10-12-23', 'pinaple', 100)
(5, '10-12-23', 'orange', 500)